{
  "site_description": "Une solution simple et légère pour intégrer l'internationalisation sur un petit projet de site web.",
  "good_morning": "Bonjour",
  "text": "Voici un exemple.",
  "fallback_text": "Cette phrase n'est pas disponible en anglais.",
  "current_lang": "Langage actuelle",
  "all_lang": "Toutes les langues dispo.",
  "license": "Licence MIT",
  "nested": {
    "one": "Il y a un singe sur l'arbre.",
    "more": "Il y a %{0} singes sur l'arbre."
  },
  "options": {
    "cols_title": {
      "method": "Méthode",
      "methods": "Méthodes",
      "tableOfContent": "Sommaire",
      "argument": "Argument",
      "default_value": "Valeur par défaut",
      "description": "Description",
      "default_options": "Options par défaut"
    },
    "params": {
      "locales": "Objet contenant vos traductions des langues. <b class='required'>Obligatoire seulement si</b> <a href='#prop-path'><code>path</code></a> n'est pas définie.",
      "path": "Chemin d'accès absolu vers le dossier contenant vos fichiers de traduction. Les fichiers vont être chargés automatiquement selon la langue active (la langue de secours sera toujours chargé). Prioritaire sur l'option <a href='#prop-locales'><code>locales</code></a>. <b class='required'>Obligatoire seulement si</b> <a href='#prop-locales'><code>locales</code></a> n'est pas définie. Ex : <code>./locales</code>.",
      "availableLocales": "Liste contenant les noms des langues disponibles tel que défini dans les fichiers de traduction. <b class='required'>Obligatoire seulement si</b> <a href='#prop-path'><code>path</code></a> est définie.",
      "lang": "Langue active à utiliser. Ne l'utilisez pas si vous souhaitez laisser le détecteur de langue du navigateur fournir la langue. Si cette option n'est pas définie, l'option <code>fallbackLang</code> devient obligatoire.",
      "fallbackLang": "Langue de secours. La langue à utiliser lorsque la langue demandée ou une chaîne demandée dans une langue non entièrement traduite est manquante. Si elle n'est pas défini, la langue de secours sera la langue actuelle.",
      "activeClass": "Classe à ajouter au bouton actif pour la langue actuelle. À utiliser seulement si <a href='#prop-togglersSelector'><code>togglersSelector</code></a> est utilisé.",
      "togglersSelector": "Sélecteur CSS pour les éléments basculeurs. si18n.js ajoutera un événement click aux éléments sélectionnés. Ne pas définir si vous utilisez la méthode <code>setLocale(lang)</code>. Ces éléments doivent <b class='required'>obligatoirement</b> avoir l'attribut <code>data-lang=\"XX\"</code> où XX correspond au code de la langue du bouton (élément basculeur) pour être détectés.",
      "isTogglerSelect": "Si le basculeur est un élément <code>select</code> ou <code>button</code> (autre).",
      "saveLang": "S'il faut enregistrer la langue dans le localStorage.",
      "saveAs": "Nom de la clé pour enregistrer la langue dans le localStorage. Si elle est définie, la valeur sera utilisée comme clé pour récupérer la langue à partir du paramètre URL (Défaut : <code>lang</code>).",
      "translate": "<b class='required'>(obligatoire)</b> - Fonction qui traduit le texte manuellement. Réservé uniquement à la traduction.<br><b>Note:</b> La balise <code>html</code> a automatiquement un attribut <code>lang</code> avec la langue actuelle, pas besoin de la coder manuellement.",
      "onChange": "Fonction de rappel déclenchée lorsque la langue change. Tout ce que vous voulez faire d'autre parce que la langue a changé, faites-le ici."
    },
    "methods": {
      "constructor": "Fait la même chose que la méthode <code>init</code> suivante.",
      "init": "<code class='recommanded'>Recommandé</code> - Initialise l'objet si18n avec les <a href='#options'>options</a> données.",
      "setLocale": "Définit la langue donnée et applique le changement en appelant la méthode d'option <code>translate</code>. N'utilisez pas cette méthode si vous avez configuré l'option <code>togglersSelector</code>.",
      "getLocale": "Renvoie le code de la langue actuelle (ex : 'en').",
      "getLocales": "Renvoie la liste de toutes les langues disponibles (ex : <code>['fr', 'en', 'it']</code>).",
      "t": "Renvoie la chaîne de traduction à la clé donnée (ex : <code>heroTitle</code>, <code>site.title</code>, <code>site.menu.link1</code>).<br>L'argument <code>valeurs</code> est facultatif. S'il est fourni, il doit contenir les clés-valeurs à remplacer. Voir l'<a href='#values-replacement'>exemple</a> ci-dessous.",
      "getJSON": "Récupère et renvoie au format JSON dans le paramètre de la fonction callback les données de l'URL fournie.",
      "toJSON": "Renvoie les options de l'instance."
    },
    "others": {
      "valuesReplacement": "Remplacement des valeurs",
      "valuesReplacementDesc": "En plus de faire des simples remplacements de textes, si18n.js peut aussi insérer des valeurs dans des espaces réservés à ce but. Il suffit de définir une clé-valeur dans l'argument <code>valeurs</code> (deuxième argument) de la méthode <a href='#fn-t'><code>t</code></a>. Et dans vos textes, il suffira de réserver les espaces par un <code>%{X}</code> où X est la clé (numéro ou nom de propriété) de la valeur à insérer. Exemple :"
    }
  },
  "main": {
    "bugReport": "Bugs ou suggestions d'amélioration ? Créez un problème ${0}."
  },
  "autoDetect": {
    "autoDetection": "Détection automatique",
    "autoDetectionDesc": "Ceci permet à si18n.js de détecter et de mettre à jour automatiquement le texte de l'élément :",
    "autoSetLangAndDir": "Les attributs <code>lang</code> et <code>dir</code> de la balise <code>html</code> sont définis automatiquement. La seule chose que vous pouvez faire pour l'attribut <code>dir</code>, c'est de le définir manuellement pour toutes les langues ou seulement pour les langues en <code>rtl</code> (string). Par défaut : <code>ltr</code>. Exemple : <code>\"rtl\": true</code>.",
    "noContent": "Pas pour le contenu des balises",
    "noContentDesc": "Lorsqu'il y a l'attribut <code>data-si18n-default</code> et que c'est défini à <code>false</code>, le texte ne sera pas défini comme contenu de la balise. Vous devez utiliser cette option uniquement pour le contenu des attributs.",
    "attrDescTitle": "Tous les attributs sont :",
    "attrDesc": "<li><code>data-si18n-default</code> : si défini sur <code>false</code>, le texte ne sera pas placé dans la balise. (Réservé pour les attributs.)</li><li><code>data-si18n-html</code> : si défini sur <code>true</code>, le texte sera ajouté sous forme de code HTML. Défaut : <code>false</code>.</li><li><code>data-si18n-value</code> pour l'attribut <code>value</code> d'une balise comme <code>option</code> et <code>input</code>.</li><li><code>data-si18n-title</code> pour l'attribut <code>title</code> de la balise.</li><li><code>data-si18n-label</code> pour l'attribut <code>label</code> d'une balise comme <code>optgroup</code>.</li><li><code>data-si18n-aria-label</code> pour l'attribut <code>aria-label</code> de la balise.</li><li><code>data-si18n-placeholder</code> pour l'attribut <code>placeholder</code> de la balise <code>input</code>.</li><li><code>data-si18n-content</code> pour l'attribut <code>content</code> d'une balise comme <code>meta</code> pour la description du site, par exemple (utile si vous utilisez la technologie <code>Prerendering</code>.</li>"
  },
  "utils": {
    "start": "Commencer",
    "demo": "Démo",
    "installation": "Installation",
    "usage": "Utilisation",
    "viewOnGithub": "Voir la source sur GitHub",
    "basicExample": "Exemple de base",
    "copy": "Copier",
    "values": "valeurs",
    "or": "ou",
    "changelog": "Journal des modifications (fr)",
    "itLangNotAvailable": "Italien : Non disponible"
  }
}
